print("=== СИСТЕМА РАСЧЕТА СКИДОК ===")
a = int(input("Введите количество покупок клиента: "))

print("=== РЕЗУЛЬТАТ ===")
print("Количество покупок: ", a)

if a >= 0 and a <= 5:
    print("Ваша скидка: 0%")
    print("Сумма к оплате: ", a * 150)

if a >= 6 and a <= 10:
    skidka1 = a * 150 * 10 / 100
    print("Ваша скидка: 10%")
    print("Сумма к оплате: ", a * 150 - skidka1)

if a >= 11 and a <= 20:
    skidka2 = a * 150 * 15 / 100
    print("Ваша скидка: 15%")
    print("Сумма к оплате: ", a * 150 - skidka2)

if a > 20:
    skidka3 = a * 150 * 20 / 100
    print("Ваша скидка: 20%")
    print("Сумма к оплате: ", a * 150 - skidka3)